{"config": [{"config": {"unroll": false, "implementation": 1, "return_state": false, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "dtype": "float32", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "units": 20, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "recurrent_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 18], "bias_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"unroll": false, "implementation": 1, "return_state": false, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "dtype": "float32", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "units": 12, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_2", "recurrent_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1, 18], "bias_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"unroll": false, "implementation": 1, "return_state": false, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "unit_forget_bias": true, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "activation": "tanh", "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "units": 6, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "lstm_3", "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow"}