{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 1, 18], "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "dtype": "float32", "recurrent_regularizer": null, "return_sequences": true, "dropout": 0.0, "stateful": false, "activation": "tanh", "bias_constraint": null, "name": "lstm_1", "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "units": 20, "trainable": true, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 1, 18], "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "dtype": "float32", "recurrent_regularizer": null, "return_sequences": true, "dropout": 0.0, "stateful": false, "activation": "tanh", "bias_constraint": null, "name": "lstm_2", "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "units": 12, "trainable": true, "bias_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "stateful": false, "recurrent_dropout": 0.0, "use_bias": true, "unit_forget_bias": true, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "return_sequences": false, "activation": "tanh", "bias_constraint": null, "name": "lstm_3", "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "unroll": false, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "implementation": 1, "units": 6, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}