{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": true, "return_state": false, "units": 20, "trainable": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "implementation": 1, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 18], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unroll": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"return_sequences": true, "return_state": false, "units": 12, "trainable": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "implementation": 1, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 18], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unroll": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "return_state": false, "units": 6, "trainable": true, "unit_forget_bias": true, "dropout": 0.0, "activation": "tanh", "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "implementation": 1, "recurrent_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_3", "recurrent_dropout": 0.0, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "name": "dense_1", "units": 1, "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "keras_version": "2.2.0", "backend": "tensorflow"}