{"backend": "tensorflow", "config": [{"config": {"recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 18], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "dtype": "float32", "go_backwards": false, "dropout": 0.0, "activation": "tanh", "implementation": 1, "unit_forget_bias": true, "name": "lstm_1", "recurrent_dropout": 0.0, "return_sequences": true, "return_state": false, "units": 20, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 1, 18], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "dtype": "float32", "go_backwards": false, "dropout": 0.0, "activation": "tanh", "implementation": 1, "unit_forget_bias": true, "name": "lstm_2", "recurrent_dropout": 0.0, "return_sequences": true, "return_state": false, "units": 12, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "stateful": false, "recurrent_regularizer": null, "go_backwards": false, "dropout": 0.0, "activation": "tanh", "implementation": 1, "unit_forget_bias": true, "name": "lstm_3", "recurrent_dropout": 0.0, "return_sequences": false, "recurrent_constraint": null, "return_state": false, "units": 6, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "units": 1}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.2.0", "class_name": "Sequential"}