{"keras_version": "2.2.0", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "implementation": 1, "go_backwards": false, "stateful": false, "batch_input_shape": [null, 1, 18], "dropout": 0.0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "return_state": false, "kernel_constraint": null, "activation": "tanh", "unroll": false, "use_bias": true, "units": 20, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "implementation": 1, "go_backwards": false, "stateful": false, "batch_input_shape": [null, 1, 18], "dropout": 0.0, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "return_state": false, "kernel_constraint": null, "activation": "tanh", "unroll": false, "use_bias": true, "units": 12, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "activity_regularizer": null, "bias_constraint": null, "implementation": 1, "go_backwards": false, "stateful": false, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 6, "trainable": true, "return_state": false, "kernel_constraint": null, "activation": "tanh", "unroll": false, "use_bias": true, "bias_regularizer": null, "dropout": 0.0, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}], "class_name": "Sequential"}