{"class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "bias_constraint": null, "trainable": true, "return_state": false, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "batch_input_shape": [null, 1, 18], "activity_regularizer": null, "name": "lstm_1", "use_bias": true, "units": 20, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_constraint": null, "go_backwards": false, "dtype": "float32", "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_constraint": null, "trainable": true, "return_state": false, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "batch_input_shape": [null, 1, 18], "activity_regularizer": null, "name": "lstm_2", "use_bias": true, "units": 12, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_constraint": null, "go_backwards": false, "dtype": "float32", "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_constraint": null, "trainable": true, "return_state": false, "unroll": false, "bias_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.0, "name": "lstm_3", "use_bias": true, "units": 6, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_constraint": null, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}