{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "implementation": 1, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "kernel_constraint": null, "units": 20, "go_backwards": false, "batch_input_shape": [null, 1, 18], "activation": "tanh", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "return_sequences": true, "stateful": false, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "implementation": 1, "name": "lstm_2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "kernel_constraint": null, "units": 12, "go_backwards": false, "batch_input_shape": [null, 1, 18], "activation": "tanh", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "return_sequences": true, "stateful": false, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "trainable": true, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "implementation": 1, "return_state": false, "name": "lstm_3", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "units": 6, "go_backwards": false, "activation": "tanh", "bias_regularizer": null, "use_bias": true, "recurrent_constraint": null, "return_sequences": false, "stateful": false, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 1, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.0"}