{"keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"return_state": false, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_1", "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "batch_input_shape": [null, 1, 18], "unit_forget_bias": true, "trainable": true, "stateful": false, "use_bias": true, "units": 20, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"return_state": false, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_2", "return_sequences": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "batch_input_shape": [null, 1, 18], "unit_forget_bias": true, "trainable": true, "stateful": false, "use_bias": true, "units": 12, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"return_state": false, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_3", "return_sequences": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "stateful": false, "use_bias": true, "units": 6, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "units": 1, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}